Revit 2026 API

# RenderingImageExposureSettingsShadows Property

---

The shadows value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Shadows { get; set; }
```
```vb
Public Property Shadows As Double
	Get
	Set
```
```cpp
public:
property double Shadows {
	double get ();
	void set (double value);
}
```
```fsharp
member Shadows : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The value of shadows is not valid. The valid range is 0.1 to 4. |

Increase this value to get darker shadows.

#### Reference

RenderingImageExposureSettings Class

Autodesk.Revit.DB Namespace